<a href="https://colab.research.google.com/github/AnthoMant/Creuse-Movie-Project/blob/main/Exploration_de_donn%C3%A9es.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

# Exploration de la dataset "name_basics"

In [4]:
name_basics = pd.read_csv('https://datasets.imdbws.com/name.basics.tsv.gz', sep='\t')

In [6]:
name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10905305 entries, 0 to 10905304
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          object
 3   deathYear          object
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: object(6)
memory usage: 499.2+ MB

In [5]:
name_basics.shape

(10905305, 6)

In [6]:
name_basics.head()

      nconst  ...                           knownForTitles
0  nm0000001  ...  tt0072308,tt0031983,tt0050419,tt0053137
1  nm0000002  ...  tt0037382,tt0117057,tt0038355,tt0071877
2  nm0000003  ...  tt0056404,tt0049189,tt0057345,tt0054452
3  nm0000004  ...  tt0072562,tt0078723,tt0080455,tt0077975
4  nm0000005  ...  tt0050976,tt0050986,tt0069467,tt0060827

[5 rows x 6 columns]

Table contenant les noms, prénoms des employés cinématographique. Elle nous indique les années de naissance ainsi que l'année de leur mort. Nous pouvons également observer leurs proféssions et dans quel oeuvre ils interviennent. Plus de 1M de personnes sont présente, et chaque valeurs de cette table ont le même type soit "object"

# Exploration de la dataset "title_akas"

In [ ]:
title_akas = pd.read_csv('https://datasets.imdbws.com/title.akas.tsv.gz', sep='\t')

In [8]:
title_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26163651 entries, 0 to 26163650
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 1.6+ GB

In [3]:
title_akas.shape

(26163651, 8)

In [7]:
title_akas.head(10)

     titleId  ordering  ...     attributes isOriginalTitle
0  tt0000001         1  ...             \N               0
1  tt0000001         2  ...  literal title               0
2  tt0000001         3  ...             \N               0
3  tt0000001         4  ...             \N               0
4  tt0000001         5  ...             \N               0
5  tt0000001         6  ...             \N               0
6  tt0000001         7  ...             \N               1
7  tt0000001         8  ...             \N               0
8  tt0000002         1  ...             \N               1
9  tt0000002         2  ...             \N               0

[10 rows x 8 columns]

Table contenant les films pour chaques régions, nous pouvons voir le titre original quand la valeur est 1 dans la colonne "isOriginalTitle". Malheureusement si la valeur de "isOriginalTitle" est 1 la valeur de "regions" n'est pas renseigner. Nous ne pourrons certainement pas classer les oeuvre par region d'origine.

# Exploration de la dataset "title_basics"

In [ ]:
title_basics = pd.read_csv('https://datasets.imdbws.com/title.basics.tsv.gz', sep='\t')

In [10]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7872543 entries, 0 to 7872542
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 540.6+ MB

In [16]:
title_basics.shape

(7872543, 9)

In [9]:
title_basics["titleType"].unique()

array(['short', 'movie', 'tvShort', 'tvMovie', 'tvSeries', 'tvEpisode',
       'tvMiniSeries', 'tvSpecial', 'video', 'videoGame'], dtype=object)

In [9]:
title_basics.head()

      tconst titleType  ... runtimeMinutes                    genres
0  tt0000001     short  ...              1         Documentary,Short
1  tt0000002     short  ...              5           Animation,Short
2  tt0000003     short  ...              4  Animation,Comedy,Romance
3  tt0000004     short  ...             12           Animation,Short
4  tt0000005     short  ...              1              Comedy,Short

[5 rows x 9 columns]

Cette table contient tout les films avec leurs caractéristique ( date de sortie, date de fin dans le cas d'une série , la durée, et les genres ). Nous pouvons observer qu'il existe 10 type pour les titres. Travaillant pour un cinéma nous allons certainement nous concentrer sur le type "movie"

# Exploration de la dataset "title_crew"

In [10]:
title_crew = pd.read_csv('https://datasets.imdbws.com/title.crew.tsv.gz', sep='\t')

In [11]:
title_crew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7872543 entries, 0 to 7872542
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   tconst     object
 1   directors  object
 2   writers    object
dtypes: object(3)
memory usage: 180.2+ MB

In [14]:
title_crew.shape

(7872543, 3)

In [11]:
title_crew.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

Table contenant le réalisateur de chaque films

# Exploration de la dataset "title_episode"

In [2]:
title_episode = pd.read_csv('https://datasets.imdbws.com/title.episode.tsv.gz', sep='\t')

In [3]:
title_episode.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5737473 entries, 0 to 5737472
Data columns (total 4 columns):
 #   Column         Dtype
---  ------         -----
 0   tconst         object
 1   parentTconst   object
 2   seasonNumber   object
 3   episodeNumber  object
dtypes: object(4)
memory usage: 175.1+ MB

In [11]:
title_episode.shape

(5737473, 4)

In [3]:
title_episode.head()

      tconst parentTconst seasonNumber episodeNumber
0  tt0041951    tt0041038            1             9
1  tt0042816    tt0989125            1            17
2  tt0042889    tt0989125           \N            \N
3  tt0043426    tt0040051            3            42
4  tt0043631    tt0989125            2            16

Tables contenant chaque épisode des séries (pas très utile pour notre cinéma)

# Exploration de la dataset "title_principals"

In [4]:
title_principals = pd.read_csv('https://datasets.imdbws.com/title.principals.tsv.gz', sep='\t')

In [5]:
title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44525540 entries, 0 to 44525539
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   tconst      object
 1   ordering    int64
 2   nconst      object
 3   category    object
 4   job         object
 5   characters  object
dtypes: int64(1), object(5)
memory usage: 2.0+ GB

In [10]:
title_principals.shape

(44525540, 6)

In [5]:
title_principals.head()

      tconst  ordering  ...                      job characters
0  tt0000001         1  ...                       \N   ["Self"]
1  tt0000001         2  ...                       \N         \N
2  tt0000001         3  ...  director of photography         \N
3  tt0000002         1  ...                       \N         \N
4  tt0000002         2  ...                       \N         \N

[5 rows x 6 columns]

Table contenant les employés pour chaque films ainsi que son role au sein du film .

# Exploration de la dataset "title_ratings"

In [12]:
title_ratings = pd.read_csv('https://datasets.imdbws.com/title.ratings.tsv.gz', sep='\t')

In [8]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1148911 entries, 0 to 1148910
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1148911 non-null  object
 1   averageRating  1148911 non-null  float64
 2   numVotes       1148911 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 26.3+ MB

In [9]:
title_ratings.shape

(1148911, 3)

In [13]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1698
1  tt0000002            6.1       211
2  tt0000003            6.5      1457
3  tt0000004            6.1       124
4  tt0000005            6.1      2256

Notes des films, avec le nombre de votes. Très utile pour classifier nos films.